int/resources/objectRepo/xmlTemplates/opera/CashieringConfig/req_CreateTransactionGenerates.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v9="http://micros/opera/ws/mdm/v9_00" xmlns:v91="http://micros/opera/ws/common/v9_00">
   <soapenv:Header/>
   <soapenv:Body>
      <v9:CreateTransactionGeneratesRQ CorrelationID="?" EchoToken="?" Enforce="?" RequestCount="?" TimeStamp="?" Version="?">
         <v91:OperaContext>
            <v91:UserLanguage/>
            <v91:CROCode/>
            <v91:HotelCode/>
            <v91:Language/>
            <v91:RunningApplication/>
            <v91:TerminalId/>
            <v91:LogLevel/>
            <v91:ExternalSystem/>
            <v91:Override/>
            <v91:TargetExternalSystem/>
            <v91:UseLocal/>
            <v91:ExternalData/>
         </v91:OperaContext>
         <v9:TransactionGenerates>
            <v91:AddBaseAmtTo Bucket1="?" Bucket2="?" Bucket3="?"/>
            <v91:Generates>
               <v91:Generate Code="?" Description="?">
                  <v91:GenerateId ID="?" IDExtension="?" ID_Context="?" Instance="?" Type="?" URL="?"/>
                  <v91:Rule>
                     <v91:Percentage Amount="?" CalculatedOn="?" UseTaxBracket="?"/>
                     <v91:FlatAmount Amount="?"/>
                     <v91:UDF/>
                     <v91:UDFFunctionName/>
                     <v91:UDFFunctionArguments>
                        <v91:FunctionArgument>
                           <v91:Name/>
                           <v91:Value/>
                           <v91:Position/>
                           <v91:DataType/>
                           <v91:Required/>
                        </v91:FunctionArgument>
                     </v91:UDFFunctionArguments>
                     <v91:TaxTypeBased>
                        <v91:TaxType Code="?" Description="?">
                           <v91:Schedule StartDate="?">
                              <v91:Rule>
                                 <v91:Percentage Amount="?" CalculatedOn="?" UseTaxBracket="?"/>
                                 <v91:FlatAmount Amount="?"/>
                                 <v91:UDF>
                                    <v91:UDF/>
                                    <v91:UDFFunctionName/>
                                    <v91:UDFFunctionArguments>
                                       <v91:FunctionArgument>
                                          <v91:Name/>
                                          <v91:Value/>
                                          <v91:Position/>
                                          <v91:DataType/>
                                          <v91:Required/>
                                       </v91:FunctionArgument>
                                    </v91:UDFFunctionArguments>
                                 </v91:UDF>
                                 <v91:DoNotPost/>
                                 <v91:RoundingMethod/>
                              </v91:Rule>
                           </v91:Schedule>
                        </v91:TaxType>
                     </v91:TaxTypeBased>
                     <v91:RoundingMethod/>
                     <v91:Posting AdjustmentType="?" ApplicableDays="?"/>
                  </v91:Rule>
                  <v91:AddGeneratedAmtTo Bucket1="?" Bucket2="?" Bucket3="?"/>
                  <v91:Level/>
               </v91:Generate>
            </v91:Generates>
            <v91:HotelCode/>
            <v91:TransactionCode/>
            <v91:TransactionGroup/>
            <v91:TransactionSubGroup/>
         </v9:TransactionGenerates>
      </v9:CreateTransactionGeneratesRQ>
   </soapenv:Body>
</soapenv:Envelope>